# 1. 1차원 배열을 만들어 결과와 같이 출력하기
# [ 0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28]

# 2. 2차원 배열을 만들어 결과와 같이 출력하기
# [[10, 20, 30, 40],
#   50, 60, 70, 80]]
       
# 3. 균등분포에 따라 임의의 2차원 난수 배열 생성 코드 작성 

# 4. 정규분포를 따라 임의의 2차원 난수 배열 생성 코드 작성 

# 5. 10 에서 50을  10개로 나눈 등간격 수열 배열 생성후  2 x 5 크기의 2차 배열로 변환하는 코드 작성

# 6. 1 ~ 6 의 실수로 이루어진 2 x 3 크기의 데이터 행렬을 만든 후 다음 조건에 맞는 코드 작성
# 조건1 
# array([[2.],
#        [5.]])를 추출 출력
# 조건 2 
# array([1., 5.]) 를 추출 출력

# 7. 0 으로 구성된 2 x 2 크기의 배열 생성 코드 작성


